tutorials/rhoSphereTest/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          1225;
        startFace       738872;
    }
    outlet
    {
        type            patch;
        nFaces          1225;
        startFace       740097;
    }
    frontAndBack
    {
        type            empty;
        nFaces          3850;
        startFace       741322;
    }
    defaultFaces
    {
        type            empty;
        nFaces          3850;
        startFace       745172;
    }
    fluid_to_solid
    {
        type            patch;
        nFaces          12184;
        startFace       749022;
    }
)


// ************************************************************************* //
