tutorials/rhoSphereTest/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-4 -4  -4)
    (10 -4  -4)
    (10  4  -4)
    (-4  4  -4)
    (-4 -4   4)
    (10 -4   4)
    (10  4   4)
    (-4  4   4)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (55 35 35)  simpleGrading (1 1 1)
);

edges
(
);

faces
(
   (3 7 6 2)
   (1 5 4 0)
   (0 3 2 1)
   (4 5 6 7)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
	faces
        (
            (4 5 6 7)
            (0 1 2 3)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
